# Parser_comb_im - Распознавание структур на изображениях (OpenSource)

Этот скрипт анализирует изображения документов и распознает следующие классы с использованием opensource библиотек:
- **Text** - текстовые блоки и параграфы
- **Table** - таблицы
- **Figure** - фигуры/изображения/диаграммы

После распознавания скрипт извлекает каждый обнаруженный объект в отдельное изображение и сохраняет его в соответствующую папку.

## Установка зависимостей

```bash
pip install -r requirements.txt
```

**Требуемые библиотеки:**
- `easyocr` - для распознавания текста
- `transformers` и `torch` - для Table Transformer (детекция таблиц)
- `opencv-python` - для обработки изображений
- `Pillow` - для работы с изображениями

## Использование

### Базовое использование

1. Поместите изображения для анализа в папку `comb_image/`
2. Запустите скрипт:

```bash
python main.py
```

Все изображения из папки `comb_image/` будут обработаны, результаты сохранятся в папку `output/`.

### Дополнительные параметры

```bash
python main.py --help
```

```bash
python main.py -i input_folder/ -o output_folder/  # Кастомные папки
python main.py --visualize                        # С визуализацией bounding boxes
python main.py --lang en ru                        # Языки для OCR (по умолчанию en ru)
python main.py --table-threshold 0.7              # Порог уверенности для таблиц
python main.py --ocr-confidence 0.5               # Порог уверенности для OCR
```

### Программное использование

```python
from analyzer import LayoutAnalyzer

# Инициализация анализатора
analyzer = LayoutAnalyzer(
    languages=["en", "ru"],           # Языки для OCR
    table_threshold=0.5,               # Порог для Table Transformer
    ocr_confidence=0.3,                # Порог для EasyOCR
    use_table_transformer=True         # Использовать Table Transformer
)

# Анализ изображения
regions = analyzer.analyze(
    image_path="comb_image/input.jpg",
    output_dir="output",
    stem="input"  # Опционально: имя для именования файлов
)

# Вывод результатов
for region in regions:
    print(f"Класс: {region['class']}, BBox: {region['bbox']}, Путь: {region['path']}")

# Визуализация результатов
analyzer.visualize(
    image_path="comb_image/input.jpg",
    regions=regions,
    output_path="output/annotated.png"
)
```

## Структура папок

### Входные данные
```
comb_image/
├── image1.jpg
├── image2.png
└── ...
```

### Выходные данные
```
output/
├── text/
│   ├── image1_text_001.png
│   ├── image1_text_002.png
│   ├── image2_text_001.png
│   └── ...
├── table/
│   ├── image1_table_001.png
│   └── ...
└── figure/
    ├── image1_figure_001.png
    └── ...
```

**Формат именования:** `{исходное_имя}_{класс}_{номер:03d}.png`

## Методы детекции

### Pipeline обработки
1. **Предобработка** - билатеральный фильтр + CLAHE для улучшения контраста
2. **OCR (EasyOCR)** - распознавание слов на изображении
3. **Детекция таблиц** - комбинация двух методов:
   - Grid-based детекция (анализ сетки слов)
   - Table Transformer (модель Microsoft)
4. **Мержинг текста** - объединение слов в строки и параграфы
5. **Детекция фигур** - анализ контуров в незанятых областях
6. **NMS** - удаление пересекающихся регионов с приоритетом: table > text > figure

### Особенности логики
- **Дедупликация таблиц**: таблицы не могут пересекаться (если таблица1 пересекается с таблицей2, остается одна)
- **Валидация больших таблиц**: таблицы > 2/3 страницы проходят дополнительную проверку:
  - Минимум 5 строк и 4 столбца
  - Высокая плотность слов
- **Фильтрация регионов**: регионы с слишком большой площадью отклоняются

## Параметры

### Константы (в analyzer.py)
- `_TABLE_MIN_ROWS = 3` - минимальное количество строк для таблицы
- `_TABLE_MIN_COLS = 3` - минимальное количество столбцов для таблицы
- `_MAX_AREA_FRAC = 0.67` - максимальная доля страницы для структуры (2/3)
- `_MAX_FIG_FRAC = 0.55` - максимальная доля страницы для фигуры
- `_TABLE_MAX_CELLW = 180` - максимальная ширина ячейки таблицы

### Аргументы CLI
- `-i, --input` - папка с входными изображениями (по умолчанию: comb_image)
- `-o, --output` - папка для результатов (по умолчанию: output)
- `-v, --visualize` - сохранять изображение с разметкой
- `--lang` - языки для EasyOCR (по умолчанию: en ru)
- `--table-threshold` - порог уверенности Table Transformer (0-1, по умолчанию: 0.5)
- `--ocr-confidence` - минимальная уверенность EasyOCR (0-1, по умолчанию: 0.3)

## Поддерживаемые языки

EasyOCR поддерживает множество языков:
- 'en' - английский
- 'ru' - русский
- 'de' - немецкий
- 'fr' - французский
- 'es' - испанский
- и другие (см. документацию EasyOCR)

## Требования к системе

- Python 3.8+
- 4GB+ RAM (для работы моделей)
- Опционально: NVIDIA GPU с CUDA для ускорения
